afrab/WSim/arch/msp430/msp430_uscib.c

/**
 *  \file   msp430_uscib.c
 *  \brief  MSP430 USCIB definition (based on "msp430_usart.c" SPI MODE)
 *  \author Julien Carpentier
 *  \date   2011
 **/

#include <stdio.h> 
#include <string.h>
#include <ctype.h>

#include "arch/common/hardware.h"
#include "msp430.h"

/*****************************************************/
/*****************************************************/
/*****************************************************/

#define HW_SPY_MODE 0

#if HW_SPY_MODE != 0
#define HW_SPY(x...) HW_DMSG_MCUDEV(x)
#else
#define HW_SPY(x...) do { } while (0)
#endif

/* defined in msp430_debug.h */
#if defined(DEBUG_USCIB)  
char *str_ssel[] = { "external UCLK", "ACLK", "SMCLK", "SMCLK" };
#endif

/*****************************************************/
/*****************************************************/
/*****************************************************/

// #define TRACER_SPI_IDLE     0 
// 
// #define TRACER_SPI_TX_RECV  1  /* data written to TXBUF      */
// #define TRACER_SPI_TX_READY 2  /* data TX shifter ok         */
// #define TRACER_SPI_RX_RECV  3  /* data written to Rx shifter */
// #define TRACER_SPI_RX_READY 4  /* data written to Rx buff    */


/*****************************************************/
/*****************************************************/
/*****************************************************/

//slau144e.pdf (page 497)
/**
 * In synchronous mode, the USCI connects the MSP430 to an externalvia three or four pins: UCxSIMO, UCxSOMI, UCxCLK, and UCxSmode is selected when the UCSYNC bit is set and SPI mode (3-pin ois selected with the UCMODEx bits.
 * SPI mode features include:
 * - 7- or 8-bit data length
 * - LSB-first or MSB-first data transmit and receive
 * - 3-pin and 4-pin SPI operation
 * - Master or slave modes
 * - Independent transmit and receive shift registers
 * - Separate transmit and receive buffer registers
 * - Continuous transmit and receive operation
 * - Selectable clock polarity and phase control
 * - Programmable clock frequency in master mode
 * - Independent interrupt capability for receive and transmit
 * - Slave operation in LPM4
 * Fig 16−1 shows the USCI when configured for SPI mode.
**/


/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

#if defined(HW_SPY_MODE)
#define HW_SPY_PRINT_CONFIG()					         \
  HW_SPY("msp430:uscib0: ============\n");                               \
  HW_SPY("msp430:uscib0:ctl0  %x\n",  MCU.uscib0.ucbxctl0.s);            \
  HW_SPY("msp430:uscib0:ctl1  %x\n",  MCU.uscib0.ucbxctl1.s);            \
  HW_SPY("msp430:uscib0:br0   %x\n",  MCU.uscib0.ucbxbr0);               \
  HW_SPY("msp430:uscib0:br1   %x\n",  MCU.uscib0.ucbxbr1);               \
  HW_SPY("msp430:uscib0:stat  %x\n",  MCU.uscib0.ucbxstat);              \
  HW_SPY("msp430:uscib0:rxbuf %x\n",  MCU.uscib0.ucbxrxbuf);             \
  HW_SPY("msp430:uscib0:txbuf %x\n",  MCU.uscib0.ucbxtxbuf);             \
  HW_SPY("msp430:uscib0: ============\n");                            
#else                                                                         
#define HW_SPY_PRINT_CONFIG() do {} while(0)
#endif

                       

#if defined(__msp430_have_uscib0)
/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

void msp430_uscib0_set_baudrate()                                  
{   
  MCU.uscib0.ucbxbr_div = ((MCU.uscib0.ucbxbr1 << 8 | MCU.uscib0.ucbxbr0) / 2) * (7+!(MCU.uscib0.ucbxctl0.b.uc7bit)); 
  HW_DMSG_USCIB("msp430:uscib0:   baudrate = div N %d/bit - %d/byte\n",      
		  ((MCU.uscib0.ucbxbr1 << 8 | MCU.uscib0.ucbxbr0) / 2),MCU.uscib0.ucbxbr_div); 
}

void msp430_uscib0_reset()
{

  MCU.uscib0.ucbxctl1.b.ucswrst     = 1; 
  
  MCU.uscib0.ucbxrxbuf              = 0;
  MCU.uscib0.ucbxrxbuf_full         = 0;
  MCU.uscib0.ucbxrx_shift_buf       = 0;
  MCU.uscib0.ucbxrx_shift_empty     = 1;
  MCU.uscib0.ucbxrx_shift_ready     = 0;
  MCU.uscib0.ucbxrx_shift_delay     = 0;
  MCU.uscib0.ucbxrx_slave_rx_done   = 0;
                                   
  MCU.uscib0.ucbxtxbuf              = 0;
  MCU.uscib0.ucbxtxbuf_full         = 0;
  MCU.uscib0.ucbxtx_full_delay      = 0;                                    
  MCU.uscib0.ucbxtx_shift_empty     = 1;
  MCU.uscib0.ucbxtx_shift_ready     = 0;
  MCU.uscib0.ucbxtx_shift_delay     = 0;

}

/***************************/
/********* MCU API *********/

/* update uscib0 within internal device loop */
void msp430_uscib0_update()
{
  do {                                                                                                                                                
      /* Tx buffer */
      if (MCU.uscib0.ucbxtxbuf_full == 1)                                        
        {                                                                     
	  if (MCU.uscib0.ucbxtx_shift_empty == 1 &&      
	      (MCU.uscib0.ucbxctl0.b.ucmst == 1 || MCU.uscib0.ucbxrx_slave_rx_done == 1))
	    /* if SPI in slave mode, tx is done immediately as delay has  */  
	    /* been taken into account by the SPI master device on rx */      
            {                                                                 
               MCU.uscib0.ucbxtx_shift_buf   = MCU.uscib0.ucbxtxbuf;                
               MCU.uscib0.ucbxtxbuf_full     = 0;                                
               MCU.uscib0.ucbxtx_full_delay  = 0;                                
               MCU.uscib0.ucbxtx_shift_empty = 0;                                
               MCU.uscib0.ucbxtx_shift_ready = 0;   
        
	       if (MCU.uscib0.ucbxctl0.b.ucmst == 1)  /* master mode */     
		 {
		   //UC7BIT, character length : 1 = 7bit ; 0 = 8bit
		   MCU.uscib0.ucbxtx_shift_delay = 7+!(MCU.uscib0.ucbxctl0.b.uc7bit);
		 }      
	       else      
		 {      
		   MCU.uscib0.ucbxtx_shift_delay = 0;      
		   MCU.uscib0.ucbxrx_slave_rx_done = 0;	      
		 }
              
		MCU.sfr.ifg2.b.ucb0txifg  = 1;                                         
		if (MCU.sfr.ie2.b.ucb0txie)                                 
                 {                                                            
                    msp430_interrupt_set(INTR_USCIX0_TX);           
                 }   
                 
                 
               HW_DMSG_USCIB("msp430:uscib0: SPI tx buf -> shifter (%d)\n",  
			     MCU.uscib0.ucbxtx_shift_delay);		      
	       HW_SPY("msp430:uscib0: SPI send (0x%x,%c) at 0x%04x\n",   
		       MCU.uscib0.ucbxtxbuf, isprint(MCU.uscib0.ucbxtxbuf) ?	      
		       MCU.uscib0.ucbxtxbuf : '.', mcu_get_pc());		      
            }                                                                 
         } /* ucbxtfubuf_full */                                                
                                                                              
      /* TX shift register */                                                 
      if (MCU.uscib0.ucbxtx_shift_empty == 0)                                    
         {                                                                    
            switch (MCU.uscib0.ucbxctl1.b.ucssel)                                  
              {                                                               
            case 0: // NA                                                     
              ERROR("msp430:usci0: SPI TX clk = UCLK, not supported\n");
	      MCU.uscib0.ucbxtx_shift_delay = 0;                                 
              break;                                                          
            case 1: // ACLK                                                          
              MCU.uscib0.ucbxtx_shift_delay -= MCU_CLOCK.ACLK_increment;         
	      HW_DMSG_USCIB("msp430:uscib0, aclk SPI delay %d\n",
			     MCU.uscib0.ucbxtx_shift_delay);                
              break;                                                          
            case 2: // SMCLK                                                          
            case 3: // SMCLK                                                         
              MCU.uscib0.ucbxtx_shift_delay -= MCU_CLOCK.SMCLK_increment;        
	      HW_DMSG_USCIB("msp430:uscib0, smclk SPI delay %d\n",
			     MCU.uscib0.ucbxtx_shift_delay);                  
              break;                                                          
              }                                                               
                                                                              
            if (MCU.uscib0.ucbxtx_shift_delay <= 0)                              
              {                                                               
               /*tracer_event_record(TRACER_uscib0##NUM,TRACER_SPI_TX_READY);*/
                 MCU.uscib0.ucbxtx_shift_ready = 1;                              
                 //MCU.uscib0.ucbxctl1.b.txept   = 1;         //empty flag MSP430x2xx ??                      
              }                                                               
         } /* tx_shift_empty */                                               
                                                                              
