afrab/WSim/arch/msp430/msp430_uscib.c
      /* RX shift register */                                              
      if (MCU.uscib0.ucbxrx_shift_empty == 0)                                    
        {                                                                     
          if (MCU.uscib0.ucbxstat.b.uclisten == 1)                          
            {                                                                 
               ERROR("msp430:uscib0: SPI listen mode not supported\n");  
            }                                                                 
                                                                              
          switch (MCU.uscib0.ucbxctl1.b.ucssel)                                    
            {                                                                 
          case 0:                                                             
            ERROR("msp430:uscib0: SPI RX clk = UCLK not supported\n");   
            MCU.uscib0.ucbxrx_shift_delay = 0;                                   
            break;                                                            
          case 1:                                                             
            MCU.uscib0.ucbxrx_shift_delay -= MCU_CLOCK.ACLK_increment;           
            break;                                                            
          case 2:                                                             
          case 3:                                                             
            MCU.uscib0.ucbxrx_shift_delay -= MCU_CLOCK.SMCLK_increment;          
            break;                                                            
            }                                                                 
                                                                              
          if (MCU.uscib0.ucbxrx_shift_delay <= 0)                                
            {                                                                 
               MCU.uscib0.ucbxrx_shift_ready = 1;                                
            }                                                                 
        } /* shift empty */                                                   
                                                                              
      if (MCU.uscib0.ucbxrx_shift_ready == 1)                                    
        {                                                                     
          if (MCU.uscib0.ucbxrxbuf_full == 1)                                    
            {                                                                 
               MCU.uscib0.ucbxstat.b.ucoe = 1;                                     
               /* sends out lots of debug message for burst writes */         
               /* ERROR("msp430:uscib0: SPI Rx Overrun (0x%x,%c)\n", */  
	       /*	     MCU.uscib0.ucbxrx_shift_buf,		*/	
	       /*   isgraph(MCU.uscib0.ucbxrx_shift_buf) ?	*/		
	       /*   MCU.uscib0.ucbxrx_shift_buf : '.');	*/		
            }                                                                 
          /*tracer_event_record(TRACER_uscib0, TRACER_SPI_RX_READY);*/    
          MCU.uscib0.ucbxrxbuf          = MCU.uscib0.ucbxrx_shift_buf;              
          MCU.uscib0.ucbxrxbuf_full     = 1;                                     
          MCU.uscib0.ucbxrx_shift_ready = 0;                                     
          MCU.uscib0.ucbxrx_shift_empty = 1;                                     
          HW_DMSG_USCIB("msp430:uscib0: SPI rx shifter -> rx buf\n");    
	  HW_SPY("msp430:uscib0: SPI receive (0x%x,%c)\n",	              
                  MCU.uscib0.ucbxrxbuf, isgraph(MCU.uscib0.ucbxrxbuf) ?	      
                  MCU.uscib0.ucbxrxbuf : '.');	                              
          MCU.sfr.ifg2.b.ucb0rxifg  = 1;                                     
          if (MCU.sfr.ie2.b.ucb0rxie)                                        
            {                                                                 
               msp430_interrupt_set(INTR_USCIX0_RX);                    
            }                                                                 
        } /* shift ready */                                                   
    } /* urxe. spie */                                                        
    while (0);  
}

/* uscib0 read from MCU */
int8_t msp430_uscib0_read(uint16_t addr)
{
  int8_t res = 0;

  switch (addr)                                                              
    {                                                                         
    case UCB0CTL0 :                                                 
      res = MCU.uscib0.ucbxctl0.s;                                               
      HW_DMSG_USCIB("msp430:uscib0: read ucbxctl0 = 0x%02x\n",res & 0xff);  
      break;                                                                 
    case UCB0CTL1 :                                                 
      res = MCU.uscib0.ucbxctl1.s;                                               
      HW_DMSG_USCIB("msp430:uscib0: read ucbxctl1 = 0x%02x\n",res & 0xff); 
      break;                                                                  
    case UCB0BR0 :                                                 
      res = MCU.uscib0.ucbxbr0;                                               
      HW_DMSG_USCIB("msp430:uscib0: read ucbxbr0 = 0x%02x\n",res & 0xff); 
      break;                                                                  
    case UCB0BR1 :                                                 
      res = MCU.uscib0.ucbxbr1;                                                 
      HW_DMSG_USCIB("msp430:uscib0: read ucbxbr1 = 0x%02x\n",res & 0xff);
      break;                                                                  
    case UCB0STAT :                                                 
      res = MCU.uscib0.ucbxstat.s;                                                  
      HW_DMSG_USCIB("msp430:uscib0: read ucbxstat = 0x%02x\n",res & 0xff);  
      break;                                                                  
    case UCB0RXBUF :                                                 
      res = MCU.uscib0.ucbxrxbuf;                                                
      MCU.sfr.ifg2.b.ucb0rxifg   = 0;                                          
      MCU.uscib0.ucbxrxbuf_full  = 0; 
      /*TRACER_TRACE_USCIB0(TRACER_USCIB0_IDLE);
      etracer_slot_event(ETRACER_PER_ID_MCU_SPI,
                           ETRACER_PER_EVT_READ_COMMAND,
                          (ETRACER_PER_ARG_WR_DST_FIFO | ETRACER_ACCESS_LVL_BUS), 0);*/
      MCU.uscib0.ucbxstat.b.ucoe = 0;                                          
      HW_DMSG_USCIB("msp430:uscib0: read ucbxrxbuf = 0x%02x\n",res & 0xff);
      break;                                                                                                                                
    case UCB0TXBUF :                                                 
      res = MCU.uscib0.ucbxtxbuf;                                                
      MCU.sfr.ifg2.b.ucb0txifg = 0;                                          
      HW_DMSG_USCIB("msp430:uscib0: read ucbxtxbuf = 0x%02x\n",res & 0xff);
      break;                                                                  
    default :                                                 
      res = 0;                                                                
      ERROR("msp430:uscib0: read bad address 0x%04x\n",addr);           
      break;                                                                  
    }   

  return res;  
}

