afrab/WSim/arch/msp430/msp430_uscib.c
/* uscib0 write from MCU */
void msp430_uscib0_write(uint16_t addr, int8_t val)
{
  switch (addr)                                                               
    {                                                                         
    case UCB0CTL0        :		/* ctrl register 0 */                                            
      { 
	/*temporary value*/
	union {                                                               
	  struct ucbxctl0_t   b;
	  uint8_t             s;                                              
	} ctl0;                                                                                                                             
	ctl0.s = val;                                               
	/*debug message*/
	HW_DMSG_USCIB("msp430:uscib0: write ucbxctl0 = 0x%02x\n", val & 0xff);                    
	HW_DMSG_USCIB("msp430:uscib0: ucckph = %d\n", 	ctl0.b.ucckph);
	HW_DMSG_USCIB("msp430:uscib0: ucckpl = %d\n", 	ctl0.b.ucckpl);
	HW_DMSG_USCIB("msp430:uscib0: ucmsb = %d\n", 	ctl0.b.ucmsb);
	HW_DMSG_USCIB("msp430:uscib0: uc7bit = %d\n", 	ctl0.b.uc7bit);
	HW_DMSG_USCIB("msp430:uscib0: ucmst = %d\n", 	ctl0.b.ucmst);
	HW_DMSG_USCIB("msp430:uscib0: ucmode = %d\n", 	ctl0.b.ucmode);
	HW_DMSG_USCIB("msp430:uscib0: ucsync = %d\n", 	ctl0.b.ucsync);                                                                     
	HW_DMSG_USCIB("msp430:uscib0: length = %d bits\n",             
                                           (ctl0.b.uc7bit == 1) ? 7:8);         
        /*modifications*/                                                                          
        MCU.uscib0.ucbxctl0.s = val;
	if (ctl0.b.uc7bit != MCU.uscib0.ucbxctl0.b.uc7bit) {                         
           msp430_uscib0_set_baudrate();                         
        } 
      }                                                                       
      break;                                                                  
             
      
    case UCB0CTL1       :		/* ctrl register 1 */                
      {                                                                       
	/*temporary value*/
	union {                                                               
	  struct ucbxctl1_t   b;
	  uint8_t             s;                                              
	} ctl1;                                                                                                                                      
	ctl1.s = val;                                                                   
	/*debug message*/
        HW_DMSG_USCIB("msp430:uscib0: write ucbxctl1 = 0x%02x\n", val & 0xff);                   
        HW_DMSG_USCIB("msp430:uscib0: ucssel = %d\n", 	ctl1.b.ucssel);
	HW_DMSG_USCIB("msp430:uscib0: unused = %d\n", 	ctl1.b.unused);
	HW_DMSG_USCIB("msp430:uscib0: ucswrst = %d\n", 	ctl1.b.ucswrst);
	/*modifications*/
	if ((ctl1.b.ucswrst == 0) && (MCU.uscib0.ucbxctl1.b.ucswrst == 0))       
          {                                                                   
             /* reset  UCB0RXIE, UCB0TXIE, UCB0RXIFG, UCOE, and UCFE bits */            
             /* set    UCB0TXIFG flag                                     */           
             HW_DMSG_USCIB("msp430:uscib0:   swrst  = 1, reset flags\n");                                             
             MCU.sfr.ie2.b.ucb0rxie           = 0;                                 
             MCU.sfr.ie2.b.ucb0txie           = 0;                                 
             MCU.sfr.ifg2.b.ucb0rxifg         = 0; 
	     MCU.sfr.ifg2.b.ucb0txifg         = 1; 
             MCU.uscib0.ucbxstat.b.ucoe       = 0;                                 
             MCU.uscib0.ucbxstat.b.ucfce      = 0;                                                                     
             /* finishing current transaction */                              
             MCU.uscib0.ucbxtxbuf_full        = 0;                                 
             MCU.uscib0.ucbxtx_full_delay     = 0;             
             MCU.uscib0.ucbxtx_shift_empty    = 1;                                 
             MCU.uscib0.ucbxrxbuf_full        = 0;                                 
             MCU.uscib0.ucbxrx_shift_empty    = 1;                                 
          }  
          MCU.uscib0.ucbxctl1.s = val;    
	}
	break;  

	
    case UCB0BR0        :		/* baud rate ctrl register 0 */                 
      /*debug message*/
      HW_DMSG_USCIB("msp430:uscib0: write ucbxbr0  = 0x%02x\n", val & 0xff);
      /*modifications*/
      MCU.uscib0.ucbxbr0 = val;                                                  
      msp430_uscib0_set_baudrate();                              
      break;  
      
      
    case UCB0BR1        :		/* baud rate ctrl register 1 */                 
      /*debug message*/
      HW_DMSG_USCIB("msp430:uscib0: write ucbxbr1  = 0x%02x\n", val & 0xff);
      /*modifications*/
      MCU.uscib0.ucbxbr1 = val;                                                  
      msp430_uscib0_set_baudrate();                            
      break;   
      
      
    case UCB0STAT       :		/* Status register */  
      {
      /*temporary value*/
	union {                                                               
	  struct ucbxstat_t   b;
	  uint8_t             s;                                              
	} stat;                                                                                                                                      
	stat.s = val;          
	/*debug message*/
        HW_DMSG_USCIB("msp430:uscib0: write ucbxstat = 0x%02x\n", val & 0xff);                   
        HW_DMSG_USCIB("msp430:uscib0: uclisten = %d\n", stat.b.uclisten);
	HW_DMSG_USCIB("msp430:uscib0: ucfce = %d\n", 	stat.b.ucfce);
	HW_DMSG_USCIB("msp430:uscib0: unused = %d\n", 	stat.b.unused);
	HW_DMSG_USCIB("msp430:uscib0: ucbusy = %d\n", 	stat.b.ucbusy);
	/*modifications*/
	MCU.uscib0.ucbxstat.s = val;
      }
      break;
      
                                                             
    case UCB0RXBUF      :                                                
      ERROR("msp430:uscib0: writing to read only register UCB0RXBUF\n");    
      break;                
      
      
    case UCB0TXBUF      :    
      {
      HW_DMSG_USCIB("msp430:uscib0: write ucbxtxbuf  = 0x%02x [PC=0x%04x]\n",val & 0xff, 
		    mcu_get_pc());					
      if ((MCU.uscib0.ucbxtxbuf_full == 1) && (MCU.uscib0.ucbxctl0.b.ucmst == 1)) /* master */ 
        {                                                                     
          WARNING("msp430:uscib0:    overwriting tx buffer with [0x%02x]\n",val & 0xff);                                              
        }                                                                     
      MCU.uscib0.ucbxtxbuf               = val;                                     
      MCU.uscib0.ucbxtxbuf_full          = 1;                                       
      MCU.uscib0.ucbxtx_full_delay       = 1;                                   
      MCU.sfr.ifg2.b.ucb0txifg           = 0;                                       
      /*TRACER_TRACE_USCIB0(TRACER_USCIB0_TX_RECV); 
      etracer_slot_event(ETRACER_PER_ID_MCU_USCIB0,                      
                           ETRACER_PER_EVT_WRITE_COMMAND,                     
                           ETRACER_PER_ARG_WR_DST_FIFO | ETRACER_ACCESS_LVL_BUS, 0); */
      
