afrab/WSim/arch/msp430/msp430_uscib.c
        HW_SPY("msp430:uscib0: write byte %x\n",val & 0xff);         
        HW_SPY_PRINT_CONFIG();                                      
                                                      
      }                                                                       
      break;    
 
    }  /* switch */                     
}

/* uscib0 chk ifg for MCU interrupt */
int msp430_uscib0_chkifg()
{
  int ret = 0;                                                               
   if (MCU.sfr.ifg2.b.ucb0txifg  && MCU.sfr.ie2.b.ucb0txie)                  
     {                                                                        
        msp430_interrupt_set(INTR_USCIX0_TX);                           
        ret = 1;                                                              
     }                                                                        
   if (MCU.sfr.ifg2.b.ucb0rxifg && MCU.sfr.ie2.b.ucb0rxie)                  
     {                                                                        
        msp430_interrupt_set(INTR_USCIX0_RX);                           
        ret = 1;                                                              
     }                                                                        
   return ret;
}

/*******************************************/
/********* External Peripheral API *********/

/* uscib0 SPI read from peripherals */
int msp430_uscib0_dev_read_spi(uint8_t *val)
{
    int ret = 0;                                                                                                             
    if (MCU.uscib0.ucbxtx_shift_ready == 1)                                   
      {                                                                    
	  *val = MCU.uscib0.ucbxtx_shift_buf;                                     
	  MCU.uscib0.ucbxtx_shift_ready = 0;                                     
	  MCU.uscib0.ucbxtx_shift_empty = 1;                                     
          /*TRACER_TRACE_USCIB0(TRACER_USCIB0_IDLE);			      
          etracer_slot_event(ETRACER_PER_ID_MCU_SPI + NUM,                    
                             ETRACER_PER_EVT_WRITE_COMMAND,                   
                            (ETRACER_PER_ARG_WR_SRC_FIFO | (ETRACER_ACCESS_LVL_SPI + NUM)), 0); */
	  ret=1;                                                           
      }
      return ret;
}

/* uscib0 SPI write from peripherals */
void msp430_uscib0_dev_write_spi(uint8_t val)
{
                                                                   
    //TRACER_TRACE_USCIB0(TRACER_SPI_RX_RECV);      
    MCU.uscib0.ucbxrx_shift_buf   = val;                                   
    MCU.uscib0.ucbxrx_shift_empty = 0;                                     
    MCU.uscib0.ucbxrx_shift_ready = 0;      
    /* no delay, as delay has been taken into account during tx*/	      
    MCU.uscib0.ucbxrx_shift_delay = 0;      
    
    if (MCU.uscib0.ucbxctl0.b.ucmst == 0)
      {
	    MCU.uscib0.ucbxrx_slave_rx_done = 1;      
          /*etracer_slot_event(ETRACER_PER_ID_MCU_SPI + NUM,                    
                             ETRACER_PER_EVT_WRITE_COMMAND,                   
                            (ETRACER_PER_ARG_WR_DST_FIFO | (ETRACER_ACCESS_LVL_SPI + NUM)), 0);*/
          HW_DMSG_USCIB("msp430:uscib0: SPI rx value 0x%02x\n",val);  
       }                                                                     
     
}

/* uscib0 SPI verification */
int msp430_uscib0_dev_write_spi_ok()
{
  return MCU.uscib0.ucbxrx_shift_empty == 1;
}



#endif

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */
